#include <stdio.h>

int main(void) {
  
  
 // 기본요금+사용량*kw당요금+세금
//(예 : 사용량 * kw 당 요금 - 270kw 사용시 요금 계산 : (100*52.0)+(100*88.5)+(70*127.8) ) 세금은 전체 사용 요금의 9%이며, 요금 적용기준은 다음과 같습니다.
//  [기본요금]
//1~100kw : 370
//101~200kw : 660
//200~300kw : 1130
//300~400kw : 2710
//401~500kw : 5130
//500kw 초과 : 9330
//[kw 당 요금]
//처음 100kw 까지 : 52.0 다음 100kw 까지 : 88.5 다음 100kw 까지 : 127.8 다음 //100kw 까지 : 184.3 다음 100kw 까지 : 274.3 500kw 초과 : 494.0
    
    int e;
    double pay;
    printf("전기 사용량을 입력하세요 : (kw)\n");
    scanf("%d", &e);
		double f = (double)e;
		printf("%lf\n", (f-300)*184.3);
    
   if(1< e <=100) {
       pay = (370 + (f*52.0))*1.09;
   } else if(101 < e <= 200) {
       pay = ((100*52.0) + 660 + ((f-100)*88.5))*1.09;
   } else if(201 < e <= 300) {
       pay = ((100 * 52.0) + 1130 + (100 * 88.5) + ((f - 200) * 127.8))*1.09;
   } else if(301 < e <= 400) {
       pay = ((100*52.0) + 2710 + ((100)*88.5) + (100*127.8) + ((f-300)*184.3))*1.09;
   } else if(401 < e <= 500) {
        pay = ((100*52.0) + 5130 + ((100)*88.5) + (100*127.8) + ((100)*184.3) + ((f-400)*274.3))*1.09;
   } else {
        pay = ((100*52.0) + 9330 + ((100)*88.5) + (100*127.8) + ((100)*184.3) + ((100)*274.3) + ((f-500)*494.0))*1.09;
   }
    
    
    
    printf("이번달 요금은 %.1lf 원 입니다.", pay);
}

